## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
google_storage_bucket.data_bucket: Refreshing state... [id=tenacious-moon-447908-u4-data-bucket]
google_service_account.function_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_custom_role.processor: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/processorRole]
google_pubsub_topic.topic: Refreshing state... [id=projects/tenacious-moon-447908-u4/topics/data-processed-topic]
google_service_account.analyst_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_custom_role.analyst: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/analystRole]
google_project_iam_custom_role.uploader: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/uploaderRole]
google_service_account.uploader_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_storage_bucket.function_bucket: Refreshing state... [id=tenacious-moon-447908-u4-function-code]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/tenacious-moon-447908-u4/datasets/serverless_processing_dataset]
google_storage_bucket_object.function_zip: Refreshing state... [id=tenacious-moon-447908-u4-function-code-function-source.zip]
google_bigquery_table.table: Refreshing state... [id=projects/tenacious-moon-447908-u4/datasets/serverless_processing_dataset/tables/processed_data]
google_project_iam_member.uploader_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/uploaderRole/serviceAccount:uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_member.processor_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/processorRole/serviceAccount:function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_member.analyst_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/analystRole/serviceAccount:analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
      + description      = "Triggered by GCS upload, validates and loads data into BigQuery"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + environment      = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = "process-uploaded-file"
      + project          = "tenacious-moon-447908-u4"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "process_file"
          + environment_variables = (known after apply)
          + runtime               = "python311"
          + service_account       = (known after apply)

          + automatic_update_policy (known after apply)

          + source {
              + storage_source {
                  + bucket     = "tenacious-moon-447908-u4-function-code"
                  + generation = (known after apply)
                  + object     = "function-source.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "us-central1"

          + event_filters {
              + attribute = "bucket"
              + value     = "tenacious-moon-447908-u4-data-bucket"
                # (1 unchanged attribute hidden)
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = (known after apply)
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 3
          + max_instance_request_concurrency = (known after apply)
          + service                          = (known after apply)
          + service_account_email            = "function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
          + timeout_seconds                  = (known after apply)
          + uri                              = (known after apply)
        }
    }

  # google_storage_bucket_object.function_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "function_zip" {
      ~ crc32c              = "E6mIog==" -> (known after apply)
      ~ detect_md5hash      = "t80phfxv6NfRDlBLDD2Gqg==" -> "different hash"
      ~ generation          = 1758536457760288 -> (known after apply)
        id                  = "tenacious-moon-447908-u4-function-code-function-source.zip"
      ~ md5hash             = "t80phfxv6NfRDlBLDD2Gqg==" -> (known after apply)
        name                = "function-source.zip"
        # (17 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>